## Plain Language Summary

A series of phenomena such as early flowering of plants and
early migratory birds are suggesting that the traditional four seasons may have changed. We focus on how
the four seasons changed during 1952–2011 and will change by the end of this century in the warming
Northern Hemisphere midlatitudes. We find that lengths and start dates of the four seasons have changed,
and the changes will be amplified in the future. Over the period of 1952–2011, <i><u>the length of summer
increased from 78 to 95 days and that of spring, autumn and winter decreased from 124 to 115, 87 to 82,
and 76 to 73 days, respectively. In addition, summer is projected to last nearly half a year, but winter less
than 2 months by 2100</u></i>. Such changes can trigger a chain of reactions in agriculture, policy-making for
agricultural management and disaster prevention requires adjustment accordingly. The seasonal-related
topics involving ecology, the ocean and the atmosphere also need to be revisited.

#### Here, we consider how the four seasons changed during 1952–2011 and will change by the end of this century in the warming Northern Hemisphere midlatitudes (30–60°N), where the division of the four seasons based on temperature is readily available.

In [387]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import netCDF4 as nc

In [388]:
ds = nc.Dataset("D:\\Earth.Org\\4seasons\\data\\HadGHCND_TXTN_acts_1950-2014_15102015\\HadGHCND_TXTN_acts_2011-2014_15102015.nc")
ds

<class 'netCDF4._netCDF4.Dataset'>
root group (NETCDF3_CLASSIC data model, file format NETCDF3):
    dimensions(sizes): time(1461), longitude(96), latitude(73)
    variables(dimensions): float32 longitude(longitude), float32 latitude(latitude), float32 time(time), float32 tmax(time, latitude, longitude), float32 tmin(time, latitude, longitude)
    groups:

In [389]:
ds['tmax'],ds['tmin']

(<class 'netCDF4._netCDF4.Variable'>
 float32 tmax(time, latitude, longitude)
     long_name: Daily Actual Maximum (TMAX) Surface (2m) Air Temperature
     units: degrees C
     missing_value: nan
 unlimited dimensions:
 current shape = (1461, 73, 96)
 filling on, default _FillValue of 9.969209968386869e+36 used,
 <class 'netCDF4._netCDF4.Variable'>
 float32 tmin(time, latitude, longitude)
     long_name: Daily Actual Minimum (TMIN) Surface (2m) Air Temperature
     units: degrees C
     missing_value: nan
 unlimited dimensions:
 current shape = (1461, 73, 96)
 filling on, default _FillValue of 9.969209968386869e+36 used)

In [390]:
# ds.variables['tmax'].set_auto_mask(False)
# ds.variables['tmin'].set_auto_mask(False)
ds.variables['time'].set_auto_mask(False)
len(ds.variables['time'][:])

1461

In [391]:
for k in ds.variables:
    ds[k].set_auto_mask(False)

array([60. , 57.5, 55. , 52.5, 50. , 47.5, 45. , 42.5, 40. ],
      dtype=float32)

In [392]:
len(ds['longitude'][:])

96

In [393]:
ds['longitude'][:]

array([  0.  ,   3.75,   7.5 ,  11.25,  15.  ,  18.75,  22.5 ,  26.25,
        30.  ,  33.75,  37.5 ,  41.25,  45.  ,  48.75,  52.5 ,  56.25,
        60.  ,  63.75,  67.5 ,  71.25,  75.  ,  78.75,  82.5 ,  86.25,
        90.  ,  93.75,  97.5 , 101.25, 105.  , 108.75, 112.5 , 116.25,
       120.  , 123.75, 127.5 , 131.25, 135.  , 138.75, 142.5 , 146.25,
       150.  , 153.75, 157.5 , 161.25, 165.  , 168.75, 172.5 , 176.25,
       180.  , 183.75, 187.5 , 191.25, 195.  , 198.75, 202.5 , 206.25,
       210.  , 213.75, 217.5 , 221.25, 225.  , 228.75, 232.5 , 236.25,
       240.  , 243.75, 247.5 , 251.25, 255.  , 258.75, 262.5 , 266.25,
       270.  , 273.75, 277.5 , 281.25, 285.  , 288.75, 292.5 , 296.25,
       300.  , 303.75, 307.5 , 311.25, 315.  , 318.75, 322.5 , 326.25,
       330.  , 333.75, 337.5 , 341.25, 345.  , 348.75, 352.5 , 356.25],
      dtype=float32)

In [394]:
time = list(pd.date_range('2011-01-01', '2014-12-31').strftime('%Y-%m-%d'))
len(time)

1461

In [395]:
#ds['tmax'][1,:,:]

In [396]:
#(ds['tmin'][4017,12:25,1] +  ds['tmax'][4017,12:25,1])/2

In [397]:
lat = []
lon = []
file = pd.DataFrame()
for t in range(len(ds['time'][:])):
    for x in ds['latitude'][12:25]:
        for y in ds['longitude'][:]:
            lat.append(x)
            lon.append(y)        
file['lat'] = lat
file['lon'] = lon
file

          lat     lon
0        60.0    0.00
1        60.0    3.75
2        60.0    7.50
3        60.0   11.25
4        60.0   15.00
...       ...     ...
1823323  30.0  341.25
1823324  30.0  345.00
1823325  30.0  348.75
1823326  30.0  352.50
1823327  30.0  356.25

[1823328 rows x 2 columns]

In [398]:
for i in range(len(file['lat'])):
    time.append(time)
len(time)

1824789

In [399]:
ds['tmax']

<class 'netCDF4._netCDF4.Variable'>
float32 tmax(time, latitude, longitude)
    long_name: Daily Actual Maximum (TMAX) Surface (2m) Air Temperature
    units: degrees C
    missing_value: nan
unlimited dimensions:
current shape = (1461, 73, 96)
filling on, default _FillValue of 9.969209968386869e+36 used

In [400]:
li = []
for i in range(len(ds['time'][:])):
    for j in range(96):
        li.extend(list((ds['tmin'][i,12:25,j] +  ds['tmax'][i,12:25,j])/2))

In [401]:
file['tavg'] = li
file

          lat     lon  tavg
0        60.0    0.00   NaN
1        60.0    3.75   NaN
2        60.0    7.50   NaN
3        60.0   11.25  3.10
4        60.0   15.00  3.35
...       ...     ...   ...
1823323  30.0  341.25   NaN
1823324  30.0  345.00   NaN
1823325  30.0  348.75   NaN
1823326  30.0  352.50   NaN
1823327  30.0  356.25   NaN

[1823328 rows x 3 columns]

In [402]:
file['lon'] = file['lon'].apply(lambda x: x - 360 if x > 180 else x)

In [403]:
file.sort_values(by=['lat', 'lon']).sort_index()

          lat    lon  tavg
0        60.0   0.00   NaN
1        60.0   3.75   NaN
2        60.0   7.50   NaN
3        60.0  11.25  3.10
4        60.0  15.00  3.35
...       ...    ...   ...
1823323  30.0 -18.75   NaN
1823324  30.0 -15.00   NaN
1823325  30.0 -11.25   NaN
1823326  30.0  -7.50   NaN
1823327  30.0  -3.75   NaN

[1823328 rows x 3 columns]

In [404]:
def checkLeap(x):
    if (x % 4) == 0:
        if (x % 100) == 0:
            if (x % 400) == 0:
                return True
            else:
                return False
        else:
            return True
    else:
        return False

In [405]:
years = [x for x in range(2011,2015)]
days = [366 if x == True else 365 for x in years]
summ = 21
wint = 12
aut = 19
spring = 15

In [406]:
file = file.dropna()
file

          lat    lon   tavg
3        60.0  11.25   3.10
4        60.0  15.00   3.35
5        60.0  18.75   3.90
6        60.0  22.50   7.45
7        60.0  26.25   8.25
...       ...    ...    ...
1823137  32.5   3.75 -12.15
1823305  30.0 -86.25   8.60
1823316  30.0 -45.00   7.60
1823317  30.0 -41.25   7.15
1823318  30.0 -37.50   7.05

[824522 rows x 3 columns]

In [407]:
# import geopandas as gpd
# file['geometry'] = gpd.points_from_xy(file['lon'], file['lat'])
# file

In [408]:
file = file.reset_index()

In [409]:
file

          index   lat    lon   tavg
0             3  60.0  11.25   3.10
1             4  60.0  15.00   3.35
2             5  60.0  18.75   3.90
3             6  60.0  22.50   7.45
4             7  60.0  26.25   8.25
...         ...   ...    ...    ...
824517  1823137  32.5   3.75 -12.15
824518  1823305  30.0 -86.25   8.60
824519  1823316  30.0 -45.00   7.60
824520  1823317  30.0 -41.25   7.15
824521  1823318  30.0 -37.50   7.05

[824522 rows x 4 columns]

In [410]:
len(set(file['lat']))*len(set(file['lon']))

1152

In [411]:
sum_li = []
wint_li = []
spring_li = []
autumn_li = []
years_li = []
lat = []
lon = []
for x in list(set(file['lat'])):
    for y in list(set(file['lon'])):
        temp = file[(file['lat'] == x)&(file['lon'] == y)]['tavg']
        start = 0
        end = 0
        for d in range(len(days)):
            summer = 0
            winter = 0
            spring = 0
            autumn = 0
            end += days[d]
            flag = 0
            for t in temp[start:end:1]:
                if (t < spring) and (flag == 0):
                    winter += 1
                elif (t >= spring) and (t < summ):
                    spring += 1
                elif (t >= summ):
                    summer += 1
                    flag = 1
                elif (t <= aut) and (t > wint):
                    autumn += 1
                elif (t <= wint):
                    winter += 1
                    flag = 0
            start = end
            sum_li.append(summer)
            wint_li.append(winter)
            spring_li.append(spring)
            autumn_li.append(autumn)
            #location.append([x,y])
            lat.append(x)
            lon.append(y)
            years_li.append(years[d])

In [412]:
# store = pd.DataFrame()
# store['Year'] = years_li
# store['Geometry'] = gpd.points_from_xy(lon,lat)
# store['Spring'] = spring_li
# store['Winter'] = wint_li
# store['Autumn'] = autumn_li
# store['Summer'] = sum_li
# store

In [413]:
temp = pd.DataFrame()
temp['Year'] = years_li
temp['Geometry'] = gpd.points_from_xy(lon,lat)
temp['Spring'] = spring_li
temp['Winter'] = wint_li
temp['Autumn'] = autumn_li
temp['Summer'] = sum_li

In [414]:
store = pd.concat([store,temp],ignore_index = True)
store

       Year                   Geometry  Spring  Winter  Autumn  Summer
0      1950   POINT (0.00000 32.50000)      19     346       0       0
1      1951   POINT (0.00000 32.50000)      21     344       0       0
2      1952   POINT (0.00000 32.50000)      21     335       8       1
3      1953   POINT (0.00000 32.50000)      20     345       0       0
4      1954   POINT (0.00000 32.50000)      18     347       0       0
...     ...                        ...     ...     ...     ...     ...
73723  2014  POINT (-7.50000 30.00000)      21     124      40     151
73724  2011  POINT (-3.75000 30.00000)      21      93      65     153
73725  2012  POINT (-3.75000 30.00000)      21     141      34     155
73726  2013  POINT (-3.75000 30.00000)      21     152      24     148
73727  2014  POINT (-3.75000 30.00000)      21     116      34     163

[73728 rows x 6 columns]

In [415]:
store.to_csv('D:\\Earth.Org\\4seasons\\season_len.csv')